;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;; (package! some-package)
;;
;; Doom checkout: 559e5b6a966fa82bf8322f89d78a00ef4181812a

;; (package! info-colors)
(package! org-modern
  :pin "e306c7df4985f77e5c4e2146900259a23a76c974"
  )
(package! svg-tag-mode
  :pin "91179d9576850312b00583910a55c798ba615382"
  )
(package! org-appear
  :pin "ddba200bb4db6947d384dcc1907b559dfcf5ef74"
  )
(package! jinx
  :pin "cd827ee199efedc8f5e094001d90206e698f91e8"
  )
(package! org-fragtog
  :pin "562f6590843eeab30ac8aa2ced285aff8d590861"
  )
(package! popper
  :pin "66b47699975fd47541c50959af47a48bb4f938cf"
  )
(package! org-download
  :pin "19e166f0a8c539b4144cfbc614309d47a9b2a9b7"
  )
(package! org-superstar
  :pin "54c81c27dde2a6dc461bb064e79a8b2089093a2e"
  )
(package! org-roam
  :pin "0b9fcbc97b65b349826e63bad89ca121a08fd2be"
  )
(package! org-roam-ui
  :pin "5ac74960231db0bf7783c2ba7a19a60f582e91ab"
  )
(package! org-roam-timestamps
  :pin "c4ff1e2f5b0905b5caa917249aab56ddc1de1ab3"
  )
(package! good-scroll
  :pin "a7ffd5c0e5935cebd545a0570f64949077f71ee3"
  )
(package! org-incoming
  :pin "5c5a5cc034a0b9ed808e5cbbf4876d489a6c7d28"
  )
(package! pdf-tools
  :pin "30b50544e55b8dbf683c2d932d5c33ac73323a16"
  )
(package! anki-editor
  :pin "546774a453ef4617b1bcb0d1626e415c67cc88df"
  )
;; (package! citar-org-roam)
;; (package! langtool)
;; (package! langtool-ignore-fonts)
;; (package! engrave-faces :recipe (:local-repo "lisp/engrave-faces"))
